DATA = '''\
火
55.1
19.5
水
56.0
21.0
木
19.7
54.1
金
19.4
55.0
土
19.6
54.9
日
18.4
54.8
月
19.1
55.1
火
55.1
18.8
水
19.4
55.2
木
19.8
55.1
金
19.5
55.1
土
55.1
20.3
日
20.1
55.3
月
20.2
54.7
火
19.7
54.9
水
55.2
20.6
木
19.2
54.2
金
19.7
54.8
土
19.0
54.9
日
20.4
54.6
月
19.5
54.2
火
20.0
54.5
水
19.5
54.9
木
19.0
54.2
金
19.1
54.0
土
13.0
54.3
日
18.9
54.4
月
19.4
54.5
火
19.5
99.9
水
18.5
54.7
木
18.6
54.7
金
21.5
55.0
土
19.2
54.7
日
20.3
55.4
月
19.5
54.9
火
19.1
54.6
水
19.6
55.0
木
20.0
54.7
金
19.8
54.6
'''

def main():
    lines = DATA.strip().splitlines()
    for i in range(0, len(lines), 3):
        day = lines[i]
        a = float(lines[i + 1])
        b = float(lines[i + 2])
        fat = min(a, b)
        weight = max(a, b)
        print(weight, fat, day, sep=",")


if __name__ == "__main__":
    main()
